{"backend": "tensorflow", "class_name": "Sequential", "keras_version": "2.1.6", "config": [{"class_name": "Conv2D", "config": {"data_format": "channels_first", "use_bias": true, "padding": "same", "dilation_rate": [1, 1], "batch_input_shape": [null, 1, 128, 128], "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "strides": [1, 1], "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}}, "name": "conv2d_1", "bias_regularizer": null, "kernel_size": [3, 3], "kernel_constraint": null, "dtype": "float32", "activation": "linear", "activity_regularizer": null, "filters": 32}}, {"class_name": "Activation", "config": {"activation": "relu", "name": "activation_1", "trainable": true}}, {"class_name": "Conv2D", "config": {"data_format": "channels_first", "use_bias": true, "padding": "valid", "dilation_rate": [1, 1], "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "strides": [1, 1], "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}}, "name": "conv2d_2", "bias_regularizer": null, "kernel_size": [3, 3], "kernel_constraint": null, "activation": "linear", "activity_regularizer": null, "filters": 32}}, {"class_name": "Activation", "config": {"activation": "relu", "name": "activation_2", "trainable": true}}, {"class_name": "MaxPooling2D", "config": {"data_format": "channels_first", "pool_size": [2, 2], "padding": "valid", "name": "max_pooling2d_1", "trainable": true, "strides": [2, 2]}}, {"class_name": "Dropout", "config": {"rate": 0.5, "seed": null, "name": "dropout_1", "trainable": true, "noise_shape": null}}, {"class_name": "Conv2D", "config": {"data_format": "channels_first", "use_bias": true, "padding": "valid", "dilation_rate": [1, 1], "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "strides": [1, 1], "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}}, "name": "conv2d_3", "bias_regularizer": null, "kernel_size": [3, 3], "kernel_constraint": null, "activation": "linear", "activity_regularizer": null, "filters": 64}}, {"class_name": "Activation", "config": {"activation": "relu", "name": "activation_3", "trainable": true}}, {"class_name": "MaxPooling2D", "config": {"data_format": "channels_first", "pool_size": [2, 2], "padding": "valid", "name": "max_pooling2d_2", "trainable": true, "strides": [2, 2]}}, {"class_name": "Dropout", "config": {"rate": 0.5, "seed": null, "name": "dropout_2", "trainable": true, "noise_shape": null}}, {"class_name": "Flatten", "config": {"data_format": "channels_last", "name": "flatten_1", "trainable": true}}, {"class_name": "Dense", "config": {"use_bias": true, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}}, "name": "dense_1", "bias_regularizer": null, "kernel_constraint": null, "activation": "linear", "units": 64, "activity_regularizer": null}}, {"class_name": "Activation", "config": {"activation": "relu", "name": "activation_4", "trainable": true}}, {"class_name": "Dropout", "config": {"rate": 0.5, "seed": null, "name": "dropout_3", "trainable": true, "noise_shape": null}}, {"class_name": "Dense", "config": {"use_bias": true, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}}, "name": "dense_2", "bias_regularizer": null, "kernel_constraint": null, "activation": "linear", "units": 4, "activity_regularizer": null}}, {"class_name": "Activation", "config": {"activation": "softmax", "name": "activation_5", "trainable": true}}]}